Blaze-CPA-03-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Blaze-CPA-03-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Blaze-CPA-03-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Blaze-CPA-03-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Login
      actions:
      - resizeWindow(1843,828)
      - go(http://34.82.219.202:8080/login?logout)
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - clickByID(submit)
    - label: Test Checking
      actions:
      - clickByLinkText(Checking)
      - clickByLinkText(View Checking)
      - clickByCSS(div.h4.m-0)
      - assertTextByCSS(div.h4.m-0): "Family Checking"
    - label: Test Savings
      actions:
      - clickByID(savings-menu)
      - clickByLinkText(View Savings)
      - clickByCSS(div.card-body)
      - assertTextByCSS(div.h4.m-0): "Personal Savings"
    - label: Logout
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)

  Blaze-CPA-03-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.132 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Login
        force-parent-sample: false
        do:
          - url: 'http://34.82.219.202:8080/login'
            method: POST
            label: 'http://34.82.219.202:8080/login'
            think-time: 0ms
            headers:
              Origin: 'http://34.82.219.202:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://34.82.219.202:8080/home'
            method: GET
            label: 'http://34.82.219.202:8080/home'
            think-time: 141ms
            headers:
              Origin: 'http://34.82.219.202:8080'
              Content-Type: application/x-www-form-urlencoded
      - transaction: Test Checking
        force-parent-sample: false
        do:
          - url: 'http://34.82.219.202:8080/account/checking-view'
            method: GET
            label: 'http://34.82.219.202:8080/account/checking-view'
            think-time: 19680ms
            headers: {}
      - transaction: Test Savings
        force-parent-sample: false
        do:
          - url: 'http://34.82.219.202:8080/account/savings-view'
            method: GET
            label: 'http://34.82.219.202:8080/account/savings-view'
            think-time: 28151ms
            headers: {}
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: 'http://34.82.219.202:8080/logout'
            method: GET
            label: 'http://34.82.219.202:8080/logout'
            think-time: 32436ms
            headers: {}